app/views/carts/_cart.html.erb

SELECT "listitems".* FROM "listitems" WHERE "listitems"."cart_id" = ?  [["cart_id", 5]]
---
<ul>
  <% @cart.listitems.each do |item| %>