app/views/carts/show.html.erb

<ul>
  <% @cart.listitems.each do |item| %>
---
SELECT "listitems".* FROM "listitems" WHERE "listitems"."cart_id" = ?  [["cart_id", 2]]