app/controllers/listitems_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-06-15 18:18:30.087211"], ["updated_at", "2023-06-15 18:18:30.087211"]]
INSERT INTO "listitems" ("product_id", "cart_id", "created_at", "updated_at", "quantity", "order_id") VALUES (?, ?, ?, ?, ?, ?)  [["product_id", 3], ["cart_id", 6], ["created_at", "2023-06-15 20:37:22.096838"], ["updated_at", "2023-06-15 20:37:22.096838"], ["quantity", 1], ["order_id", nil]]
UPDATE "listitems" SET "updated_at" = ?, "quantity" = ? WHERE "listitems"."id" = ?  [["updated_at", "2023-06-15 20:55:34.646224"], ["quantity", 2], ["id", 6]]
---
  def create
   # @listitem = Listitem.new(listitem_params)
   #@listitem = @cart.listitems.build(product_id: params[:product_id])
   @listitem = @cart.add_item(params[:product_id])

    respond_to do |format|
      if @listitem.save