app/controllers/orders_controller.rb

SELECT "listitems".* FROM "listitems" WHERE "listitems"."cart_id" = ?  [["cart_id", 6]]
SELECT 1 AS one FROM "listitems" WHERE "listitems"."cart_id" = ? LIMIT ?  [["cart_id", 6], ["LIMIT", 1]]
---
  def new
    if @cart.listitems.empty?

INSERT INTO "orders" ("name", "address", "email", "paytype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(order_params)
    @order.update_listitems_table(@cart)


    respond_to do |format|
      if @order.save