app/controllers/shopper_controller.rb

  def list
    @products = Product.order(:name)
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC