app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        respond_to do |format|
            if @user.save
---
INSERT INTO "users" ("name", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "yuanzhen"], ["email", nil], ["phone", nil], ["created_at", "2023-06-16 06:50:16.764125"], ["updated_at", "2023-06-16 06:50:16.764125"]]