app/models/cart.rb

SELECT "listitems".* FROM "listitems" WHERE "listitems"."cart_id" = ? AND "listitems"."product_id" = ? LIMIT ?  [["cart_id", 2], ["product_id", 3], ["LIMIT", 1]]
---
    def add_item(product_id)
        current = self.listitems.find_by(product_id: product_id)