app/models/order.rb

SELECT "listitems".* FROM "listitems" WHERE "listitems"."cart_id" = ?  [["cart_id", 7]]
---
    def update_listitems_table(cart_object)
        cart_object.listitems.each do |item|